Repository: feiandxs/ichess
Catalog: ichess/ichess/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Play Again
zh_hans: 再来一盘

source: View Board
zh_hans: 看看棋盘

source: You Won
zh_hans: 你赢了

source: Checkmate
zh_hans: 将死了

source: You Resigned
zh_hans: 你认输了

source: Draw
zh_hans: 和棋

source: Well played!
zh_hans: 这局下得漂亮

source: Keep practicing. Try another game!
zh_hans: 再试一盘就熟了

source: Newcomer
zh_hans: 新手

source: Beginner
zh_hans: 入门

source: Intermediate
zh_hans: 熟练

source: Advanced
zh_hans: 进阶

source: Expert
zh_hans: 高手

source: Master Challenge
zh_hans: 大师挑战

source: Learn the rules at a relaxed pace
zh_hans: 刚学会规则，轻松练习

source: Practice captures and protecting pieces
zh_hans: 会基本吃子、保护棋子

source: Spot tactics and anticipate replies
zh_hans: 能发现常见战术，考虑对方反击

source: A stronger challenge for regular players
zh_hans: 经常下棋，想要更强的挑战

source: For experienced players
zh_hans: 有较丰富的对局经验

source: Take on a powerful opponent
zh_hans: 挑战高强度电脑对手

source: Light
zh_hans: 浅色

source: Dark
zh_hans: 深色

source: Pieces
zh_hans: 棋子

source: Undo
zh_hans: 悔棋

source: New
zh_hans: 重开

source: Thinking
zh_hans: 分析

source: Hint
zh_hans: 提示

source: Resign
zh_hans: 认输

source: Computer Move Unavailable
zh_hans: 电脑暂时无法走棋

source: Retry
zh_hans: 重试

source: Cancel
zh_hans: 取消

source: Resign this game?
zh_hans: 确认认输？

source: Keep Playing
zh_hans: 继续下棋

source: This game will count as a loss and your points will be updated.
zh_hans: 本局将记为负局，并按现有规则结算积分。

source: Done
zh_hans: 完成

source: Chess engine files are missing. Please reinstall the full app.
zh_hans: 缺少棋力引擎资源，请重新安装完整版本。

source: The chess engine is unavailable. Please try again.
zh_hans: 棋力引擎暂不可用，请稍后再试。

source: Promote Pawn
zh_hans: 升变成

source: Queen
zh_hans: 后

source: Rook
zh_hans: 车

source: Bishop
zh_hans: 象

source: Knight
zh_hans: 马

source: Stalemate
zh_hans: 无子可动

source: Threefold repetition
zh_hans: 三次重复

source: Fifty-move rule
zh_hans: 五十步规则

source: Insufficient material
zh_hans: 子力不足

source: By agreement
zh_hans: 双方同意

source: You resigned · You lost
zh_hans: 已认输 · 你输了

source: Computer is thinking
zh_hans: 对方思考中

source: Your turn
zh_hans: 轮到你了

source: Computer’s turn
zh_hans: 对方走

source: You are in check
zh_hans: 你被将军

source: Computer is in check
zh_hans: 对方被将军

source: Checkmate · You lost
zh_hans: 将死 · 你输了

source: Checkmate · You won
zh_hans: 将死 · 你赢了

source: Draw · Stalemate
zh_hans: 和棋 · 无子可动

source: Draw · Threefold repetition
zh_hans: 和棋 · 三次重复

source: Draw · Fifty-move rule
zh_hans: 和棋 · 五十步

source: Draw · Insufficient material
zh_hans: 和棋 · 子力不足

source: Choose a promotion
zh_hans: 选择升变

source: W
zh_hans: 胜

source: L
zh_hans: 负

source: D
zh_hans: 和

source: Not sure? Start with Beginner.
zh_hans: 不确定选哪档？可以先选入门。

source: Choose before your first move to apply immediately. Changes during a game apply next game. Difficulty does not change the points you earn in Battle.
zh_hans: 开始第一步之前选择会立即生效，对局中更改则从下一局开始。难度不会影响你在对战中获得的积分。

source: Choose Difficulty
zh_hans: 选择难度

source: Choose Your Level
zh_hans: 选择你的水平

source: Points %@
zh_hans: 积分 %@

source: Level: %@
zh_hans: 难度：%@

source: Next: %@
zh_hans: 下盘：%@

source: Current game: %@
zh_hans: 当前对局：%@

source: Original artwork
zh_hans: 自绘

source: Original SVG artwork
zh_hans: 自绘 SVG

# Win streak: %lld
source: %lld wins in a row
zh_hans: 连胜 %lld

# Loss streak: %lld
source: %lld losses in a row
zh_hans: 连败 %lld

source: Red marks: moving there loses material
zh_hans: 红色标记：走到这里会丢子

source: Your %@ on %@ can be captured for free
zh_hans: 你的%1$@（%2$@）会被白吃

source: Your %@ on %@ and %lld more can be captured for free
zh_hans: 你的%1$@（%2$@）和另外 %3$lld 个子会被白吃

source: Pawn
zh_hans: 兵

source: King
zh_hans: 王

source: Mark pieces that can be captured for free
zh_hans: 标出会被白吃的子

source: Mark risky squares for the selected piece
zh_hans: 选子时标出危险落点

source: Follow System
zh_hans: 跟随系统

source: Language
zh_hans: 语言

source: Settings
zh_hans: 设置

source: Practice
zh_hans: 练习

source: Battle
zh_hans: 对战

source: Mode
zh_hans: 模式

source: No streak yet
zh_hans: 暂无连胜

source: Practice aids
zh_hans: 练习辅助

source: Suggested move: %@
zh_hans: 建议走法：%@

source: Practice games don’t count toward points
zh_hans: 练习局不计积分

source: This is a practice game, so your points won’t change.
zh_hans: 这是一盘练习局，积分不会变化。

source: Trying moves
zh_hans: 试走中

source: Best move
zh_hans: 最佳

source: Good move
zh_hans: 好棋

source: Inaccuracy
zh_hans: 不够精确

source: Mistake
zh_hans: 失误

source: Blunder
zh_hans: 大漏着

source: You missed a checkmate.
zh_hans: 你漏掉了一步杀棋。

source: This lets your opponent checkmate you.
zh_hans: 这步会让对方将死你。

source: This move loses your %@.
zh_hans: 这步会丢掉你的%@。

source: Your opponent can capture your %@.
zh_hans: 对方可以吃掉你的%@。

source: You missed a chance to capture a %@.
zh_hans: 你漏掉了吃%@的机会。

source: Better: %@
zh_hans: 更好的是 %@

source: Your opponent will checkmate you (%@)
zh_hans: 对方会将死你（%@）

source: Your opponent will capture your %@ with a %@ (%@)
zh_hans: 对方会用%2$@吃掉你的%1$@（%3$@）

source: Your opponent will give check (%@)
zh_hans: 对方会将军（%@）

source: Your opponent will play %@
zh_hans: 对方会走 %@

source: It also gives check.
zh_hans: 同时还将了军。

source: You’d come out behind in material.
zh_hans: 这样你会亏子。

source: But you can capture back.
zh_hans: 不过你可以吃回去。

source: Your opponent could checkmate you within %lld moves.
zh_hans: 对方 %lld 步内可以将死你。

source: This checkmates your opponent!
zh_hans: 这步直接将死对方！

source: This move ends the game in a draw.
zh_hans: 这步之后会形成和棋。

source: Forced mate for you
zh_hans: 可强制杀棋

source: You may get mated
zh_hans: 面临被杀

source: Winning
zh_hans: 大优

source: Clearly better
zh_hans: 明显占优

source: Slightly better
zh_hans: 略占优

source: Equal
zh_hans: 均势

source: Slightly worse
zh_hans: 略落后

source: Clearly worse
zh_hans: 明显落后

source: Losing
zh_hans: 大幅落后

source: Evaluation: %@ → %@
zh_hans: 局面评估：%@ → %@

source: Evaluation: %@
zh_hans: 局面评估：%@

source: Try moves
zh_hans: 试走

source: Back
zh_hans: 后退

source: Reset
zh_hans: 重新试

source: Play this move
zh_hans: 这步就走它

source: Your opponent is replying…
zh_hans: 对方正在思考…

source: Try a move to see how your opponent could answer. Nothing here changes your real game.
zh_hans: 走一步试试，看看对方会怎么应对。这里的操作不会影响真实对局。

source: Try moving this piece
zh_hans: 试试动这个子

source: Try moving it to the marked square
zh_hans: 试试走到标出的这一格

source: Likely continuation: %@
zh_hans: 接下来可能是：%@

source: Hint %lld/3
zh_hans: 提示 %lld/3

source: Review each move after you play
zh_hans: 每步棋后点评

source: Your move %lld. %@: %@
zh_hans: 你的第 %1$lld 步 %2$@：%3$@

source: Win chances: %@ → %@
zh_hans: 胜率：%1$@ → %2$@

source: How moves are rated
zh_hans: 评级是怎么算的

source: After you move, Stockfish evaluates the position before and after your move, about %@ seconds each.
zh_hans: 你走完一步后，Stockfish 会分别评估这步棋之前和之后的局面，每个局面约 %@ 秒。

source: Each evaluation is converted into your win chances (0 to 100 percent) using Lichess’s published formula.
zh_hans: 每个评估都会用 Lichess 公开的公式换算成你的胜率（0 到 100 之间）。

source: The rating depends on how far your win chances dropped: Inaccuracy from %lld points, Mistake from %lld, Blunder from %lld. Within %lld point of the best move counts as Best.
zh_hans: 评级看你的胜率下降了多少：下降 %1$lld 个百分点起算不够精确，%2$lld 起算失误，%3$lld 起算大漏着；和最佳着法相差不到 %4$lld 个百分点算最佳。

source: Lichess uses 5 / 10 / 15 points (10 / 20 / 30 on its −100…100 scale). These are a little more lenient, because the search is short and this app is for learners.
zh_hans: Lichess 的标准是 5 / 10 / 15 个百分点（在它 −100…100 的胜算刻度上是 10 / 20 / 30）。这里稍微宽松一些，因为搜索时间短，也因为这个应用是给初学者用的。

source: A rating is always about your move, never the computer’s. Evaluations are estimates and can change with deeper search.
zh_hans: 评级永远只针对你的这一步，不针对电脑。评估只是估计，搜得更深可能会有变化。

source: Best
zh_hans: 最佳

source: Good
zh_hans: 好棋

source: Resigned
zh_hans: 已认输

source: Left unfinished
zh_hans: 未下完

source: Win
zh_hans: 胜

source: Loss
zh_hans: 负

source: Unfinished
zh_hans: 未完成

source: Review
zh_hans: 复盘

source: Game history
zh_hans: 对局记录

source: Show win chances
zh_hans: 显示胜率

source: Win chances
zh_hans: 胜率

source: Your win chances
zh_hans: 你的胜率

source: Reviewing your move…
zh_hans: 正在评估你的这一步…

source: Analyzing the game… %lld/%lld
zh_hans: 正在分析对局… %1$lld/%2$lld

source: Analysis unavailable right now.
zh_hans: 暂时无法分析。

source: Accuracy
zh_hans: 准确率

source: Key moment
zh_hans: 关键时刻

source: No big mistakes. Nicely played!
zh_hans: 没有大的失误，下得不错！

source: This game is no longer available.
zh_hans: 这盘棋已不存在。

source: First move
zh_hans: 第一步

source: Previous move
zh_hans: 上一步

source: Next move
zh_hans: 下一步

source: Last move
zh_hans: 最后一步

source: Moves
zh_hans: 着法

source: Starting position
zh_hans: 起始局面

source: Computer’s move %@
zh_hans: 电脑的着法 %@

source: Engine line: %@
zh_hans: 引擎推荐的后续：%@

source: Your move %@
zh_hans: 你的着法 %@

source: Analyzing…
zh_hans: 分析中…

source: Not analyzed yet.
zh_hans: 还没有分析。

source: Key mistakes
zh_hans: 关键错误

source: No games yet
zh_hans: 还没有对局记录

source: Finished games show up here so you can review them.
zh_hans: 下完的棋会出现在这里，方便复盘。

source: Delete
zh_hans: 删除

source: %lld moves
zh_hans: %lld 步

source: Soft Geometry
zh_hans: 圆润几何

source: Crisp Facets
zh_hans: 锐角切面

source: Bold Blocks
zh_hans: 厚重积木

source: Monoline
zh_hans: 单线轮廓

source: Badge Discs
zh_hans: 圆徽章

source: Show coordinates
zh_hans: 显示坐标

source: Move animation speed
zh_hans: 走子动画速度

source: Fast
zh_hans: 快

source: Normal
zh_hans: 标准

source: Slow
zh_hans: 慢

source: You can checkmate in one move. Look for it!
zh_hans: 你一步就能将死对方，找找看！

source: Your opponent threatens to checkmate you next move!
zh_hans: 对方下一步就能将死你！

source: You have a forced checkmate within %lld moves. Look for it!
zh_hans: 你在 %lld 步内有强制杀棋，找找看！

source: Your opponent’s %@ on %@ is giving check. Capture it, block it, or move your king.
zh_hans: 对方 %2$@ 的%1$@正在将军。吃掉它、挡住它，或者移开你的王。

source: Your opponent’s %@ on %@ has no defender. Can you capture it?
zh_hans: 对方 %2$@ 的%1$@没人保护，看看能不能吃。

source: Your opponent’s %@ on %@ attacks your undefended %@ on %@.
zh_hans: 对方的%1$@在 %2$@，正在攻击你 %4$@ 的%3$@，且没人保护。

source: Your %@ on %@ attacks your opponent’s more valuable %@ on %@. Can you win it?
zh_hans: 你 %2$@ 的%1$@正在攻击对方 %4$@ 更值钱的%3$@，看看能不能吃。

source: Your opponent’s %@ on %@ attacks your %@ on %@, which is worth more.
zh_hans: 对方 %2$@ 的%1$@正在攻击你 %4$@ 的%3$@，它比攻击者更值钱。

source: Your opponent’s %@ on %@ is attacked more times than it is defended. Can you win it?
zh_hans: 对方 %2$@ 的%1$@被攻击的次数比被保护的多，看看能不能吃。

source: Your %@ on %@ is attacked more times than it is defended.
zh_hans: 你 %2$@ 的%1$@被攻击的次数比被保护的多。

source: Your %@ on %@ attacks both your opponent’s %@ on %@ and %@ on %@.
zh_hans: 你 %2$@ 的%1$@同时攻击对方 %4$@ 的%3$@和 %6$@ 的%5$@。

source: Your opponent’s %@ on %@ attacks both your %@ on %@ and %@ on %@.
zh_hans: 对方 %2$@ 的%1$@同时攻击你 %4$@ 的%3$@和 %6$@ 的%5$@。

source: Look for a move where your %@ attacks your opponent’s %@ and %@ at once.
zh_hans: 找找看：你的%1$@能不能走到一个同时攻击对方%2$@和%3$@的位置。

source: Watch out: your opponent’s %@ could attack your %@ and %@ at once.
zh_hans: 小心：对方的%1$@可能同时攻击你的%2$@和%3$@。

source: Your opponent’s %@ on %@ is pinned to their king by your %@ on %@.
zh_hans: 对方 %2$@ 的%1$@被你 %4$@ 的%3$@牵制在王前。

source: Your %@ on %@ is pinned to your king by your opponent’s %@ on %@.
zh_hans: 你 %2$@ 的%1$@被对方 %4$@ 的%3$@牵制在王前，不能随便动。

source: Your %@ on %@ pins your opponent’s %@ on %@ to their %@ on %@.
zh_hans: 你 %2$@ 的%1$@牵制了对方 %4$@ 的%3$@，它身后是 %6$@ 的%5$@。

source: Your %@ on %@ is pinned by your opponent’s %@ on %@. If it moves, your %@ on %@ is attacked.
zh_hans: 你 %2$@ 的%1$@被对方 %4$@ 的%3$@牵制：它一动，%6$@ 的%5$@就会被攻击。

source: Your %@ on %@ attacks your opponent’s %@ on %@, with their %@ on %@ behind it.
zh_hans: 你 %2$@ 的%1$@攻击对方 %4$@ 的%3$@，它身后 %6$@ 的%5$@也在线上。

source: Your opponent’s %@ on %@ attacks your %@ on %@, with your %@ on %@ behind it.
zh_hans: 对方 %2$@ 的%1$@攻击你 %4$@ 的%3$@，它身后 %6$@ 的%5$@也有危险。

source: Try not to bring your queen out too early. Develop your knights and bishops first.
zh_hans: 别太早出后，先把马和象走出来。

source: Consider castling to keep your king safe.
zh_hans: 考虑王车易位，让王更安全。

source: %lld of your knights or bishops are still at home. Try developing them.
zh_hans: 还有 %lld 个马或象没出动，试着把它们走出来。

source: Fight for the center with a pawn on %@ or %@.
zh_hans: 用兵去争中心，比如 %1$@ 或 %2$@。

source: Your opponent’s %@ on %@ is giving check. Deal with the check first.
zh_hans: 对方 %2$@ 的%1$@正在将军，先解决将军。

source: Your opponent threatens checkmate with %@!
zh_hans: 对方想用 %@ 将死你！

source: Your opponent wants to capture your %@ with a %@ (%@). It has no defender.
zh_hans: 对方想用%2$@吃你的%1$@（%3$@）——它没人保护。

source: Your opponent wants to capture your %@ with a %@ (%@). You would lose material.
zh_hans: 对方想用%2$@吃你的%1$@（%3$@）——换子你会吃亏。

source: Your opponent wants to capture your %@ with a %@ (%@), but you can capture back.
zh_hans: 对方想用%2$@吃你的%1$@（%3$@），不过你可以吃回来。

source: Your opponent wants to capture your %@ with a %@ (%@).
zh_hans: 对方想用%2$@吃你的%1$@（%3$@）。

source: Your opponent wants to give check with a %@ (%@).
zh_hans: 对方想用%1$@将军（%2$@）。

source: Your opponent would like to play %@.
zh_hans: 对方想走 %@。

source: No immediate threat. Your opponent would probably play %@.
zh_hans: 暂时没有直接威胁，对方大概会走 %@。

source: What’s my opponent threatening?
zh_hans: 对方想干什么

source: Checking what your opponent wants…
zh_hans: 正在看对方想干什么…

source: Your opponent’s threat
zh_hans: 对方的威胁

source: Nothing urgent stands out right now.
zh_hans: 暂时没有特别要留意的。

source: Auto key-point reminders
zh_hans: 自动提醒重点

source: Their threat
zh_hans: 对方威胁

source: Go back
zh_hans: 返回

source: Coordinate position
zh_hans: 坐标位置

source: Outside board
zh_hans: 棋盘外

source: Inside board
zh_hans: 棋盘内

source: It checkmates your opponent!
zh_hans: 这一步将死对方！

source: It stops your opponent’s checkmate threat.
zh_hans: 它挡住了对方的杀棋威胁。

source: It gets your king out of check.
zh_hans: 它让你的王摆脱了将军。

source: It wins your opponent’s undefended %@ on %@.
zh_hans: 它能白吃对方 %2$@ 上没人保护的%1$@。

source: It captures your opponent’s %@ on %@ and comes out ahead.
zh_hans: 它吃掉对方 %2$@ 的%1$@，而且你是赚的。

source: It trades your %@ for your opponent’s %@.
zh_hans: 它用你的%1$@换掉对方的%2$@，换得公平。

source: It promotes your pawn to a %@.
zh_hans: 它把你的兵升变成%@。

source: It threatens to win your opponent’s %@ on %@.
zh_hans: 它威胁要吃掉对方 %2$@ 的%1$@。

source: It threatens checkmate next move.
zh_hans: 它威胁下一步将死对方。

source: It gives check.
zh_hans: 它将军了。

source: It saves your %@ on %@ from being captured.
zh_hans: 它保住了你 %2$@ 的%1$@，不会被吃。

source: It deals with your opponent’s threat.
zh_hans: 它化解了对方的威胁。

source: It castles, which tucks your king away safely and brings a rook into play.
zh_hans: 它王车易位，让王更安全，车也出来了。

source: It develops your %@ into the game.
zh_hans: 它把你的%@走出来参战。

source: It stakes a claim in the center.
zh_hans: 它占住了中心。

source: It helps you control the center.
zh_hans: 它帮你控制中心。

source: It keeps your position solid and gives you the best chances.
zh_hans: 它让局面更稳，给你最好的机会。

source: You can checkmate your opponent this move. Look at every check!
zh_hans: 这一步你就能将死对方，把每个将军都看一遍！

source: Your opponent threatens checkmate. Stop it first!
zh_hans: 对方威胁要将死你，先把它挡住！

source: Your king is in check. Get out of check first.
zh_hans: 你的王被将军了，先解除将军。

source: One of your opponent’s pieces can be captured for free. Look for it!
zh_hans: 对方有个子可以白吃，找找看！

source: You can win material with a smart capture.
zh_hans: 一次聪明的吃子就能赚到子力。

source: Trading pieces is a good idea here.
zh_hans: 这里换子对你有利。

source: Your pawn can promote. Go for it!
zh_hans: 你的兵可以升变了，走起！

source: Look for a way to pin one of your opponent’s pieces.
zh_hans: 找找看，能不能牵制对方的一个子。

source: Look for a long-range attack that hits two pieces in a line.
zh_hans: 找一个远程攻击，一条线上同时打到两个子。

source: Look for a move that attacks two pieces at once.
zh_hans: 找一步能同时攻击两个子的棋。

source: Look for a move that threatens one of your opponent’s pieces.
zh_hans: 找一步能威胁对方某个子的棋。

source: Look for a move that threatens checkmate.
zh_hans: 找一步能威胁将死的棋。

source: A check can help you here.
zh_hans: 这里将军可能对你有帮助。

source: One of your pieces is in danger. Save it first.
zh_hans: 你有个子正在危险中，先保住它。

source: Your opponent has a threat. Deal with it first.
zh_hans: 对方有个威胁，先应付它。

source: Think about getting your king to safety.
zh_hans: 想想怎么让你的王安全。

source: Bring another knight or bishop into the game.
zh_hans: 再出一个马或象参战。

source: Think about the center of the board.
zh_hans: 想想棋盘的中心。

source: Nothing urgent here. Improve the position of your pieces.
zh_hans: 没有急事，把你的子摆到更好的位置。

source: Your %@ on %@ can deliver checkmate.
zh_hans: 你 %2$@ 的%1$@能将死对方。

source: Your %@ on %@ can stop the checkmate.
zh_hans: 你 %2$@ 的%1$@能挡住杀棋。

source: Your %@ on %@ can get you out of check.
zh_hans: 你 %2$@ 的%1$@能解除将军。

source: Your %@ on %@ can make a good capture.
zh_hans: 你 %2$@ 的%1$@能吃到好子。

source: Your pawn on %@ is ready to promote.
zh_hans: 你 %@ 的兵可以升变了。

source: Your %@ on %@ can create a strong attack.
zh_hans: 你 %2$@ 的%1$@能发起强力进攻。

source: Your %@ on %@ can start an attack.
zh_hans: 你 %2$@ 的%1$@能发起进攻。

source: Your %@ on %@ can threaten checkmate.
zh_hans: 你 %2$@ 的%1$@能威胁将死。

source: Your %@ on %@ can give check.
zh_hans: 你 %2$@ 的%1$@能将军。

source: Your %@ on %@ is in danger. Move it to safety.
zh_hans: 你 %2$@ 的%1$@有危险，把它带到安全的地方。

source: Your %@ on %@ can protect your attacked piece.
zh_hans: 你 %2$@ 的%1$@能保护被攻击的子。

source: Your %@ on %@ can deal with your opponent’s threat.
zh_hans: 你 %2$@ 的%1$@能化解对方的威胁。

source: Your king on %@ should move to safety.
zh_hans: 你 %@ 的王该去安全的地方了。

source: Your %@ on %@ hasn’t joined the game yet.
zh_hans: 你 %2$@ 的%1$@还没出来参战。

source: Your %@ on %@ can claim space in the center.
zh_hans: 你 %2$@ 的%1$@能去占中心。

source: Your %@ on %@ can reach a strong central square.
zh_hans: 你 %2$@ 的%1$@能走到中心的好位置。

source: Your %@ on %@ can make the most useful move.
zh_hans: 你 %2$@ 的%1$@走一步最有用。

source: Also fine
zh_hans: 也不错

source: Weaker
zh_hans: 较差

source: Compare moves
zh_hans: 候选走法

source: Compare
zh_hans: 候选

source: What to think about
zh_hans: 想想这个

source: Try moving the marked piece
zh_hans: 试试动标出的这个子

source: Win chances after this move: %@
zh_hans: 走完这步的胜率：%@

source: Only move
zh_hans: 只有这一步

source: Several good moves
zh_hans: 好几步都行

source: Comparing the best moves…
zh_hans: 正在比较最好的几步…

source: This is the only good move.
zh_hans: 只有这一步是好棋。

source: Several good moves. Pick the one you like.
zh_hans: 好几步都不错，挑你喜欢的。

source: One move is a bit better than the rest.
zh_hans: 有一步比其他的略好。

source: Line: %@
zh_hans: 后续：%@

source: Tap a move to see it on the board.
zh_hans: 点一步，在棋盘上看它。

source: It moves your attacked %@ to safety.
zh_hans: 它把被攻击的%@带到了安全的地方。

source: Line demo
zh_hans: 走法演示

source: You
zh_hans: 你

source: Opponent
zh_hans: 对方

source: Castles (%@)
zh_hans: 王车易位（%@）

source: Pawn promotes to a %@ on %@ (%@)
zh_hans: 兵在 %2$@ 升变为%1$@（%3$@）

source: %@ takes the %@ on %@ (%@)
zh_hans: %1$@吃 %3$@ 的%2$@（%4$@）

source: %@ to %@ (%@)
zh_hans: %1$@到 %2$@（%3$@）

source: checkmate!
zh_hans: 将死！

source: check
zh_hans: 将军

source: wins a %@
zh_hans: 赢一个%@

source: an even trade
zh_hans: 等价交换

source: attacks the %@ and the %@ at once
zh_hans: 同时攻击%1$@和%2$@

source: pins the %@ on %@
zh_hans: 牵制了 %2$@ 的%1$@

source: attacks the %@ on %@, with the %@ behind it
zh_hans: 攻击 %2$@ 的%1$@，它身后是%3$@

source: threatens the %@ on %@
zh_hans: 威胁 %2$@ 的%1$@

source: threatens checkmate next move
zh_hans: 威胁下一步杀棋

source: stops the checkmate threat
zh_hans: 挡住了杀棋威胁

source: gets out of check
zh_hans: 解除了将军

source: moves the %@ to safety
zh_hans: 把%@带到了安全的地方

source: protects the %@ on %@
zh_hans: 保住了 %2$@ 的%1$@

source: deals with the threat
zh_hans: 化解了威胁

source: develops the %@
zh_hans: 出动%@

source: stakes a claim in the center
zh_hans: 占据中心

source: controls the center
zh_hans: 控制中心

source: This line ends with you checkmating your opponent.
zh_hans: 这条线以你将死对方结束。

source: This line ends with your opponent checkmating you.
zh_hans: 这条线以对方将死你结束。

source: End of the line: %@
zh_hans: 这条线走完：%@

source: End of the line: %@, win chances about %@
zh_hans: 这条线走完：%1$@，胜率约 %2$@

source: material is even
zh_hans: 子力相当

source: you are up %lld points of material
zh_hans: 你多 %lld 分子力

source: your opponent is up %lld points of material
zh_hans: 对方多 %lld 分子力

source: you are up a %@
zh_hans: 你多一个%@

source: your opponent is up a %@
zh_hans: 对方多一个%@

source: you are up a %@ and a %@
zh_hans: 你多一个%1$@和一个%2$@

source: your opponent is up a %@ and a %@
zh_hans: 对方多一个%1$@和一个%2$@

source: Show line
zh_hans: 演示

source: Demo %lld/%lld
zh_hans: 演示 %1$lld/%2$lld

source: Exit
zh_hans: 退出

source: Start of line
zh_hans: 回到开头

source: Previous step
zh_hans: 上一步

source: Next
zh_hans: 下一步

source: End of line
zh_hans: 走完了

source: Showing %@ and what could follow, one move at a time (%lld in all). Tap Next to play each move.
zh_hans: 演示 %1$@ 和之后可能的走法，一次一步（共 %2$lld 步）。每点一下「下一步」走一步。

source: takes it back
zh_hans: 吃回来

source: Pause on mistakes
zh_hans: 失误时暂停

source: Take back
zh_hans: 撤回重走

source: Show me
zh_hans: 看演示

source: Continue
zh_hans: 继续

source: Look back
zh_hans: 回看

source: Paused
zh_hans: 已暂停
